sample/102_0_openfoam_hollow_cylinder_heat_transfer/constant/fluid/radiationProperties
FoamFile
{
    format ascii;
    class dictionary;
    location "constant/fluid";
    object radiationProperties;
}

radiation off;
radiationModel none;
absorptionEmissionModel none;
scatterModel none;
sootModel none;
