sample/102_0_openfoam_hollow_cylinder_heat_transfer/constant/fluid/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// 層流として扱う(簡易サンプルのため)。より高いRa数での乱流を扱いたい場合は
// 乱流へ変更する場合はsimulationTypeをRASにし、RAS辞書を複数行で追加する。
// のように変更し、0.orig/fluid に k, epsilon フィールドを追加すること。

simulationType  laminar;


// ************************************************************************* //
