sample/102_0_openfoam_hollow_cylinder_heat_transfer/constant/regionProperties
FoamFile
{
    format ascii;
    class dictionary;
    object regionProperties;
}

regions
(
    fluid
    (
        fluid
    )
    solid
    (
        solid
    )
);
