sample/102_0_openfoam_hollow_cylinder_heat_transfer/system/blockMeshDict
FoamFile
{
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1;

vertices
(
    (-0.15 -0.15 -0.05)
    ( 0.15 -0.15 -0.05)
    ( 0.15  0.15 -0.05)
    (-0.15  0.15 -0.05)
    (-0.15 -0.15  0.25)
    ( 0.15 -0.15  0.25)
    ( 0.15  0.15  0.25)
    (-0.15  0.15  0.25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (24 24 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    roomWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (3 7 6 2)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
