sample/102_0_openfoam_hollow_cylinder_heat_transfer/system/decomposeParDict
FoamFile
{
    format ascii;
    class dictionary;
    object decomposeParDict;
}

numberOfSubdomains 4;
method scotch;
