sample/102_0_openfoam_hollow_cylinder_heat_transfer/system/fluid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-7;
        relTol          0.1;
    }

    rhoFinal
    {
        $rho;
        tolerance       1e-7;
        relTol          0;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       1e-7;
        relTol          0.01;
        smoother        GaussSeidel;
        maxIter         100;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-6;
        relTol          0;
        maxIter         100;
    }

    "(U|h)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    "(U|h)Final"
    {
        $U;
        tolerance       1e-7;
        relTol          0;
    }

    Ii
    {
        solver          GAMG;
        tolerance       1e-4;
        relTol          0.1;
        smoother        symGaussSeidel;
        maxIter         10;
        nPostSweeps     1;
    }

    G
    {
        $Ii;
    }
}

PIMPLE
{
    momentumPredictor       yes;
    nCorrectors             1;
    nNonOrthogonalCorrectors 0;
    pRefCell                0;
    pRefValue               1e5;
}

relaxationFactors
{
    equations
    {
        "h.*"           1;
        "U.*"           1;
    }
}


// ************************************************************************* //
