sample/102_0_openfoam_hollow_cylinder_heat_transfer/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// nOuterCorrectors: fluid<->solid リージョン間の結合反復回数。
// 輻射+CHT結合の安定性のため既定(1)より少し増やしている。

PIMPLE
{
    nOuterCorrectors 1;
}


// ************************************************************************* //
