sample/102_0_openfoam_hollow_cylinder_heat_transfer/system/solid/createHeaterPatchDict
FoamFile
{
    format ascii;
    class dictionary;
    object createPatchDict;
}

pointSync false;

patches
(
    {
        name heaterPower;
        patchInfo
        {
            type wall;
        }
        constructFrom set;
        set heaterFaces;
    }
);
