sample/102_0_openfoam_hollow_cylinder_heat_transfer/system/surfaceFeatureExtractDict
FoamFile
{
    format ascii;
    class dictionary;
    object surfaceFeatureExtractDict;
}

specimen.stl
{
    extractionMethod extractFromSurface;
    extractFromSurfaceCoeffs
    {
        includedAngle 150;
    }
    writeObj yes;
}
