sample/102_0_openfoam_hollow_cylinder_heat_transfer/system/topoSetDict
FoamFile
{
    format ascii;
    class dictionary;
    object topoSetDict;
}

actions
(
    {
        name solidCells;
        type cellSet;
        action new;
        source zoneToCell;
        zones
        (
            solid
        );
    }
    {
        name fluidCellSet;
        type cellSet;
        action new;
        source boxToCell;
        box (-1 -1 -1) (1 1 1);
    }
    {
        name fluidCellSet;
        type cellSet;
        action subtract;
        source cellToCell;
        set solidCells;
    }
    {
        name fluid;
        type cellZoneSet;
        action new;
        source setToCellZone;
        set fluidCellSet;
    }
);
